# St7MoveToOriginMinXYZ

Moves the minimum XYZ point of selected entities to the origin of a coordinate system.

long St7MoveToOriginMinXYZ(long uID, long UCSId)
Input Parameters
uID
Strand7 model file ID.
UCSId
The coordinate system specifying the minimum point.
Dependencies
Selection
Entities can be selected using functions in Entity Selection.
Keep Selected
Assigned using St7SetKeepSelect.